USE [CruisesDb]
GO

SET IDENTITY_INSERT [Layners] ON;

INSERT INTO [Layners] ([Id], [Name], [Descr], [ImageName])
	VALUES
		(1, 'Caribbean Princess 5*lux', N'Лайнер был спущен на воду в апреле 2004 года. Caribbean Princess 5*lux стал первым из лайнеров компании Princess, на котором появился впечатляющий кинотеатр под открытым небом.', 
		'layner.jpg'),

		(2, 'Coral Princess', N'Лайнер был спущен на воду в январе 2003 года и обновлен в январе 2019 года. Coral Princess, построенный специально для круизов через Панамский Канал - уютный лайнер, сочетает в себе роскошную красоту и домашний комфорт.',
		'layner1.jpg'),

		(3, 'ФЛАГМАН - Sky Princess 5* lux', N'Sky Princess 5* lux. сохранит все черты, которые стали визитной карточкой компании: грандиозный атриум с огромным разнообразием развлечений и уютных ресторанов, \"кино под звездами\" и \"персональный кусочек моря\" - все внешние каюты оборудованы балконом. Компания продолжит свой курс на инновации, добавив на новом лайнере еще больше новых возможностей.',
		'layner2.jpg');

SET IDENTITY_INSERT [Layners] OFF;

SET IDENTITY_INSERT [Cabins] ON;
INSERT INTO [Cabins] ([Id], [Deck], [LaynerId], [CabinType], [AdultCount], [ChildCount])
	VALUES
		(1001, 1, 1, 1, 1, 0),
		(1002, 1, 1, 1, 1, 1),
		(1003, 1, 1, 2, 1, 2),
		(1004, 1, 1, 0, 2, 0),
		(1005, 1, 1, 1, 2, 1),
		(1006, 1, 1, 2, 2, 2),
		(1007, 1, 1, 1, 2, 3),
		(1008, 1, 1, 1, 3, 0),
		(1009, 1, 1, 0, 3, 1),
		(1010, 1, 1, 1, 3, 2),
		(1011, 1, 1, 1, 3, 3),
		(1012, 1, 1, 3, 4, 0),
		(1013, 1, 1, 1, 4, 1),
		(1014, 1, 1, 0, 4, 2),
		(1015, 1, 1, 2, 4, 3),
		(1016, 1, 1, 2, 1, 0),
		(1017, 1, 1, 2, 1, 1),
		(1018, 1, 1, 2, 1, 2),
		(1019, 1, 1, 2, 2, 0),
		(1020, 1, 1, 0, 2, 1),
		(1021, 1, 1, 2, 2, 2),
		(1022, 1, 1, 3, 2, 3),
		(1023, 1, 1, 2, 3, 0),
		(1024, 1, 1, 0, 3, 1),
		(1025, 1, 1, 2, 3, 2),
		(1026, 1, 1, 1, 3, 3),
		(1027, 1, 1, 0, 4, 0),
		(1028, 1, 1, 2, 4, 1),
		(1029, 1, 1, 2, 4, 2),
		(1030, 1, 1, 2, 4, 3),

		(2001, 2, 1, 1, 1, 0),
		(2002, 2, 1, 1, 1, 1),
		(2003, 2, 1, 2, 1, 2),
		(2004, 2, 1, 0, 2, 0),
		(2005, 2, 1, 1, 2, 1),
		(2006, 2, 1, 2, 2, 2),
		(2007, 2, 1, 1, 2, 3),
		(2008, 2, 1, 1, 3, 0),
		(2009, 2, 1, 0, 3, 1),
		(2010, 2, 1, 1, 3, 2),
		(2011, 2, 1, 1, 3, 3),
		(2012, 2, 1, 3, 4, 0),
		(2013, 2, 1, 1, 4, 1),
		(2014, 2, 1, 0, 4, 2),
		(2015, 2, 1, 2, 4, 3),
		(2016, 2, 1, 2, 1, 0),
		(2017, 2, 1, 2, 1, 1),
		(2018, 2, 1, 2, 1, 2),
		(2019, 2, 1, 2, 2, 0),
		(2020, 2, 1, 0, 2, 1),
		(2021, 2, 1, 2, 2, 2),
		(2022, 2, 1, 3, 2, 3),
		(2023, 2, 1, 2, 3, 0),
		(2024, 2, 1, 0, 3, 1),
		(2025, 2, 1, 2, 3, 2),
		(2026, 2, 1, 1, 3, 3),
		(2027, 2, 1, 0, 4, 0),
		(2028, 2, 1, 2, 4, 1),
		(2029, 2, 1, 2, 4, 2),
		(2030, 2, 1, 2, 4, 3),

		(3001, 3, 1, 1, 1, 0),
		(3002, 3, 1, 1, 1, 1),
		(3003, 3, 1, 2, 1, 2),
		(3004, 3, 1, 0, 2, 0),
		(3005, 3, 1, 1, 2, 1),
		(3006, 3, 1, 2, 2, 2),
		(3007, 3, 1, 1, 2, 3),
		(3008, 3, 1, 1, 3, 0),
		(3009, 3, 1, 0, 3, 1),
		(3010, 3, 1, 1, 3, 2),
		(3011, 3, 1, 1, 3, 3),
		(3012, 3, 1, 3, 4, 0),
		(3013, 3, 1, 1, 4, 1),
		(3014, 3, 1, 0, 4, 2),
		(3015, 3, 1, 2, 4, 3),
		(3016, 3, 1, 2, 1, 0),
		(3017, 3, 1, 2, 1, 1),
		(3018, 3, 1, 2, 1, 2),
		(3019, 3, 1, 2, 2, 0),
		(3020, 3, 1, 0, 2, 1),
		(3021, 3, 1, 2, 2, 2),
		(3022, 3, 1, 3, 2, 3),
		(3023, 3, 1, 2, 3, 0),
		(3024, 3, 1, 0, 3, 1),
		(3025, 3, 1, 2, 3, 2),
		(3026, 3, 1, 1, 3, 3),
		(3027, 3, 1, 0, 4, 0),
		(3028, 3, 1, 2, 4, 1),
		(3029, 3, 1, 2, 4, 2),
		(3030, 3, 1, 2, 4, 3),

		(4001, 4, 1, 1, 1, 0),
		(4002, 4, 1, 1, 1, 1),
		(4003, 4, 1, 2, 1, 2),
		(4004, 4, 1, 0, 2, 0),
		(4005, 4, 1, 1, 2, 1),
		(4006, 4, 1, 2, 2, 2),
		(4007, 4, 1, 1, 2, 3),
		(4008, 4, 1, 1, 3, 0),
		(4009, 4, 1, 0, 3, 1),
		(4010, 4, 1, 1, 3, 2),
		(4011, 4, 1, 1, 3, 3),
		(4012, 4, 1, 3, 4, 0),
		(4013, 4, 1, 1, 4, 1),
		(4014, 4, 1, 0, 4, 2),
		(4015, 4, 1, 2, 4, 3),
		(4016, 4, 1, 2, 1, 0),
		(4017, 4, 1, 2, 1, 1),
		(4018, 4, 1, 2, 1, 2),
		(4019, 4, 1, 2, 2, 0),
		(4020, 4, 1, 0, 2, 1),
		(4021, 4, 1, 2, 2, 2),
		(4022, 4, 1, 3, 2, 3),
		(4023, 4, 1, 2, 3, 0),
		(4024, 4, 1, 0, 3, 1),
		(4025, 4, 1, 2, 3, 2),
		(4026, 4, 1, 1, 3, 3),
		(4027, 4, 1, 0, 4, 0),
		(4028, 4, 1, 2, 4, 1),
		(4029, 4, 1, 2, 4, 2),
		(4030, 4, 1, 2, 4, 3);

SET IDENTITY_INSERT [Cabins] OFF;


SET IDENTITY_INSERT [Insurances] ON;

INSERT INTO [Insurances] ([Id], [Name], [Cost])
	VALUES
		(1, N'Страхование жизни и здоровья', 2900),
		(2, N'Страхование имущества', 3500);

SET IDENTITY_INSERT [Insurances] OFF;

INSERT INTO [Tours] 
	VALUES
			(N'Круиз «Музыка фьордов и города Балтики»', N'Регион: Северная Европа " +
                "Продолжительность: 14 ночей " +
                "Порты отправления: Санкт - Петербург " +
                "Русскоязычная группа: есть заезды с группой " +
                "Города стоянок: Санкт - Петербург(Россия), Таллин(Эстония), Киль(Германия), Копенгаген(Дания), Хеллесилт - Гейрангер(Норвегия), Олесунн(Норвегия), Флом(Норвегия), Хельсинки(Финляндия)', 12030, 5140, 'turImage1.jpg', 1, 4, '09/22/2021', N'Спб'),

			(N'Круиз «Жемчужины Адриатики»', N'Регион: Средиземное море " +
                "Продолжительность: 7 ночей " +
                "Порты отправления: Триест, Бари " +
                "Русскоязычная группа: нет " +
                "Города стоянок: Триест(Италия), Задар(Хорватия), Бари(Италия), о.Корфу(Греция), Котор(Черногория), Сплит(Хорватия), Bar, Montenegro(Черногория), Риека(Хорватия)', 17000, 6160, 'turImage2.jpg', 2, 5, '08/31/2021', N'Севастополь'),
			(N'Круиз \"Персидский залив\"', N'Регион: Средиземное море " +
                "Продолжительность: 7 ночей " +
                "Порты отправления: Триест, Бари " +
                "Русскоязычная группа: нет " +
                "Города стоянок: Триест(Италия), Задар(Хорватия), Бари(Италия), о.Корфу(Греция), Котор(Черногория), Сплит(Хорватия), Bar, Montenegro(Черногория), Риека(Хорватия)', 11040, 4140, 'turImage3.jpg', 3, 3, '07/12/2021', N'Спб')
